---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.ApiDelayedUpdateFailed
source: html/66f703f1-7ba9-fde3-fcdb-2f4429a44d91.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DocumentFailures.ApiDelayedUpdateFailed Property

Delayed Updating Failed. Please contact the 3rd Party Application vendor.

## Syntax (C#)
```csharp
public static FailureDefinitionId ApiDelayedUpdateFailed { get; }
```